def t(*a):
    b=0
    for i in a:
        b+=i
    print(b)
lst=[14,55,85,35]
t(*lst)

print('-----------位置实参-------------')
def fun(a,b,c,d,e):  #abcde是在函数定义处的形式参数
    print(a,b,c,d,e)
#函数的调用
fun(19,23,75,34,45)  #函数调用处的参数传递，称为位置传参
print('-----------将列表中的每个元素都转换为位置实参-----------')
lst=[19,23,75,34,45]
fun(*lst)            #在函数调用时，将列表中的每个元素转换为位置实参传入
print('-----------关键字实参------------')
fun(a=100,b=200,c=300,d=400,e=500)  #函数调用时的关键字实参
print('-----------将字典中的每个键值对都转换成关键字实参-------------')
dict={'a':100,'b':200,'c':300,'d':400,'e':500}
fun(**dict)

