print('----------默认值形参------------')
def fun(a,b=10):  #b是默认值形参
    print(a,b)

print('----------个数可变的位置形参------------')
def fun(*args):   #个数可变的位置形参
    print(args)
fun(10,20,30,40)  #生成元组

print('----------个数可变的关键字形参------------')
def fun1(**args): #个数可变的关键字形参
    print(args)
fun1(a=11,b=22,c=33,d=44,e=55)  #返回的结果是字典

print('----------关键字形参’*‘------------')
def fun4(a,b,c,d):
    print(a,b,c,d)
fun4(10,20,30,40)    #位置实参
fun4(a=10,b=20,c=30,d=40)   #关键字实参
fun4(10,20,c=30,d=40)   #前两个是位置实参，后两个是关键字实参
'''如何让后两个必须采用关键字实参传递'''
def fun5(a,b,*,c,d):   #单独的*放在这里表示从*之后在函数调用时只能采用关键字实参
    print(a,b,c,d)
#fun5(10,20,30,40) 程序报错，后两个必须采用关键字实参
fun5(10,20,c=30,d=40)

'''函数定义时形参的顺序问题'''
def fun(a,b=10,*,c,d,**args):
    pass
def fun(*args,**args1):
    pass


