'''格式化字符串'''
print('---------使用%做占位符---------------')
name='宋晓盼'
age=33
print('我叫%s，今年%d岁了。' % (name,age))

print('---------使用{}做占位符---------------')
print('我叫{0}，今年{1}岁了。我确实叫{0}。'.format(name,age))
'''花括号里的是索引，对照元组里元素的索引'''

print('---------使用f-string---------------')
print(f'我叫{name}，今年{age}岁了。我确实叫{name}')

print('-------------如何设置字符串的宽度，使用%的方式--------------')
print('%d' % 99)
print('%10d' % 99)   #10代表宽度
print('%f' % 3.1415926)
'''设置保留三位小数'''
print(('%.3f' % 3.1415926)) #.3代表小数点后保留3位
'''同时表示宽度和精度'''
print('%10.3f' % 3.1415926)  #10表示宽度，.3表示精度

print('-------------如何设置字符串的宽度，使用{}的方式--------------')
print('{}'.format(3.1415926))
print('{0:.3}'.format(3.1415926))  #.3表示一共保留三位数
print('{0:.3f}'.format(3.1415926)) #.3f表示保留小数点后三位
print('{0:10.3f}'.format(3.1415926))  #同时设置宽度和精度，宽度为10，小数点后留三位